# 大数据推送账单查费接口压测

import random
from urllib.parse import quote

from locust import task, TaskSet
from locust.contrib.fasthttp import FastHttpUser


class pushBilling(TaskSet):

    user_id = [58, 67, 263, 311, 619, 672, 705, 754, 763, 875, 891, 920, 928, 930, 938, 967, 983, 995, 1025, 1829, 1854,
               1865, 1936, 2026, 2028, 2074, 2094, 2153, 2172, 2201, 2217, 2326, 2361, 2372, 2405, 2490, 2618, 2763,
               2847, 2848, 2899, 3024, 3320, 3357, 3362, 3448, 3468, 3512, 3535, 3536, 3569, 3592, 3627, 3744, 3759,
               3805, 3859, 3881, 3905, 3910, 3942, 3978, 4050, 4076, 4099, 4109, 4123, 4197, 4249, 4315, 4317, 4394,
               4477, 4544, 4579, 4620, 4712, 4754, 4765, 4773, 4988, 5234, 5633, 5953, 6108, 6127, 6182, 6192, 6310,
               6341, 6507, 6514, 6573, 6615, 6662, 6701, 6703, 6716, 6732, 6766, 6868, 6891, 6933, 6981, 6994, 7018,
               7021, 7072, 7213, 7258, 7292, 7326, 7345, 7443, 7480, 7597, 7619, 7876, 7936, 7941, 8027, 8034, 8134,
               8138, 8273, 8299, 8305, 8316, 8319, 8348, 8386, 8400, 8408, 8411, 8511, 8585, 8636, 8758, 8778, 8851,
               8980, 8999, 9143, 9157, 9294, 9319, 9389, 9453, 9460, 9534, 9641, 9660, 9681, 9735, 9795, 9824, 9856,
               9887, 10026, 10060, 10078, 10309, 10339, 10446, 10463, 10465, 10468, 10574, 10746, 10756, 10811, 10865,
               10887, 10888, 10960, 10973, 11041, 11041, 11065, 11202, 11204, 11305, 11309, 11331, 11357, 11370, 11395,
               11488, 11685, 11694, 11723, 11725, 11736, 11747, 11753, 11758, 11771, 11785, 11868, 11912, 11926, 11927,
               11954, 11962, 11992, 12171, 12176, 12271, 12295, 12297, 12337, 12349, 12370, 12407, 12461, 12471, 12497,
               12564, 12565, 12574, 12575, 12641, 12653, 12653, 12864, 12879, 12908, 13021, 13076, 13078, 13079, 13131,
               13228, 13277, 13285, 13309, 13315, 13320, 13445, 13508, 13511, 13519, 13545, 13546, 13566, 13657, 13751,
               13799, 13814, 13986, 14106, 14111, 14137, 14166, 14173, 14252, 14403, 14406, 14471, 14487, 14497, 14508,
               14611, 14628, 14637, 14683, 14742, 14770, 14778, 14786, 14794, 14799, 14806, 14869, 14875, 14880, 14921,
               14932, 14969, 14992, 15005, 15012, 15034, 15088, 15091, 15122, 15124, 15167, 15191, 15205, 15231, 15257,
               15305, 15307, 15335, 15365, 15387, 15417, 15453, 15477, 15573, 15573, 15584, 15597, 15601, 15641, 15655,
               15715, 15730, 15743, 15854, 15909, 16127, 16129, 16138, 16167, 16168, 16208, 16262, 16440, 16490, 16511]

    plate_number = ['京N5BN89', '京LL3677', '京NB7V18', '京C12345', '京N20M69', '京NMQ051', '京HB9170', '粤AH108C', '京NQ5F88',
                    '京N0HN66', '京P005R9', '京J81019', '京FP6982', '京N168S3', '京LR5053', '京NX3G28', '京NM7381', '京N5CZ12',
                    '京QJY281', '京N475T8', '京P2RA61', '京ER4329', '京LF1367', '京LG3880', '京L72196', '京NP0S18', '京N9AZ39',
                    '京NBG820', '京HN3935', '京ND4141', '京L01867', '京N68LA8', '冀F99V70', '粤ALN215', '京N89M59', '京QWA117',
                    '京NK5226', '京K80261', '京AG0455', '鲁NEK357', '沪DK7195', '京L50509', '京JU0306', '京KD6915', '京M97756',
                    '京NJX502', '京A00061', '京MQ5779', '京J59000', '京FS7209', '京A00092', '京HX5001', '京K96629', '京N829C0',
                    '京A00199', '京N5M999', '闽C322SD', '京JP2540', '京J11668', '京E00080', '京N55D11', '京A00313', '京NX5K77',
                    '京N185T7', '京FV0670', '京NJ3C33', '京KN6898', '京N6X5M6', '京A3WX89', '京KH0013', '京NBM438', '京KD5302',
                    '京Q55126', '京QSA509', '京NM1817', '京NY0E66', '京LES360', '京A00452', '京N56C46', '京NJ9X56', '京N3ES28',
                    '京NGL498', '京H76662', '京NY9M12', '京FK2938', '京FAM050', '京NQ7N89', '京F73403', '京NEG980', '京EP5792',
                    '京FT2911', '京CN7675', '京A58531', '京FJ0758', '京LR7699', '京EF5166', '京Q99EG8', '京NAX129', '冀A778VP',
                    '京AAC7852', '京HB5629', '京Q60098', '京AD73227', '京N15H80', '京NLK132', '京NA2339', '京QJX895', '京G89348',
                    '京N2SQ09', '京NT8887', '京NX0338', '京LU7707', '京NLC302', '京NYF926', '京P507V3', '京NKM077', '京GZW679',
                    '沪N60611', '京P6X697', '京LGB236', '沪B6M957', '沪A6F988', '京HV5810', '京N78J55', '京L89915', '京C90226',
                    '京MC8989', '京KM0852', '京MP6595', '京L16160', '京ADM3219', '京N5WT12', '京LT3938', '京GQH562', '京HM6750',
                    '沪L22719', '京N381Q6', '京NRF710', '京NSV058', '皖GN3961', '京A9MR99', '京N9E078', '京MF8859', '京MK5669',
                    '京NNA753', '京N35K56', '京M86539', '京F22790', '京AG9517', '京AAU6821', '冀R7F0H8', '京Q23HX2', '京ER7790',
                    '京LW6271', '京N8H522', '京N52H59', '京LA0793', '京NSG020', '京NCC369', '京QC3012', '京NLB165', '京F22969',
                    '京NDD288', '京NY5055', '京N52V78', '京N332S0', '京JC8833', '京NZL386', '京ME3960', '京NAW665', '京AD8805',
                    '京EF3825', '京N8DB10', '京NSA372', '京LD5668', '京NK8H76', '京ADL2716', '京NQ5233', '京ET1733', '京MA0691',
                    '沪FHC359', '粤B7B2U5', '渝AMY519', '京P9Q568', '辽AS6Y08']

    def on_start(self):
        print("开始压测推送账单接口周月季。。。")

    def on_stop(self):
        print("------ Test over ------")

    @task(10)
    def push_bill_w(self):
        # res = self.client.get(
        #     "/push_bill?user_id=" + str(random.choice(pushBilling.user_id)) +
        # "&plate_number=" + quote(str(random.choice(pushBilling.plate_number)[0]),
        #                          encoding='utf-8') + "&p_t=w", name="周推送")

        res = self.client.get("/push_bill?user_id=" + str(random.choice(pushBilling.user_id)) + "&plate_number=" +
                              quote(random.choice(pushBilling.plate_number)) + "&p_t=w", name="周")
        # res = self.client.get("/push_bill?user_id=" + str(763) + "&plate_number=" + quote(str('京NQ5F88')) + "&p_t=w", name="周推送（有响应）")
        if res.status_code != 200:
            print("出错了，错误信息：", res.text)
        else:
            print(res.text)

    # @task(1)
    def push_none(self):
        res = self.client.get("/push_bill?user_id=263&plate_number=京q6qd17&p_t=w")
        if res.status_code != 200:
            print("出错了，错误信息：", res.text)
        else:
            pass

    # @task(1)
    def push_bill_m(self):
        self.client.get("/push_bill?user_id=23555438&plate_number=藏Q6QD177&p_t=m", name="月推送")

    # @task(1)
    def push_bill_q(self):
        self.client.get("/push_bill?user_id=23555438&plate_number=藏Q6QD177&p_t=q", name="季推送")


class pushUser(FastHttpUser):
    tasks = [pushBilling]
    min_wait = 1000
    max_wait = 3000
    host = "http://10.103.22.88:8090/hp"  # qa
